{
  "_name_or_path": "distilbert-base-uncased",
  "activation": "gelu",
  "architectures": [
    "DistilBertForTokenClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {
    "0": "O",
    "1": "B-Action",
    "2": "B-Target",
    "3": "I-Target",
    "4": "B-Destination",
    "5": "I-Destination",
    "6": "B-Location",
    "7": "I-Location"
  },
  "initializer_range": 0.02,
  "label2id": {
    "B-Action": 1,
    "B-Destination": 4,
    "B-Location": 6,
    "B-Target": 2,
    "I-Destination": 5,
    "I-Location": 7,
    "I-Target": 3,
    "O": 0
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "torch_dtype": "float32",
  "transformers_version": "4.31.0",
  "vocab_size": 30522
}
